Revit 2023 API
PathReinforcement.PrimaryBarOrientation Property
 Orientation of primary bars of Path Reinforcement.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2016
Syntax
C#
public ReinforcementBarOrientation PrimaryBarOrientation { get; set; }
Visual Basic
Public Property PrimaryBarOrientation As ReinforcementBarOrientation
	Get
	Set
Visual C++
public:
property ReinforcementBarOrientation PrimaryBarOrientation {
	ReinforcementBarOrientation get ();
	void set (ReinforcementBarOrientation value);
}
Remarks
 The orientation corresponds to the bars' rotation in the Path Reinforcement element. It indicates the postion of the major segment of the primary Rebar Shape relative to the edges of a rectangular region which bounds the Path Reinforcement, where the top/exterior and bottom/interior come from the cover boundaries of the host, the near side edge is defined by the Path Reinforcement sketch line, and the far side edge is derived from bar length (defaulting to 5').
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: This orientation is not allowed for primary bars.
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
See Also
PathReinforcement Class
Autodesk.Revit.DB.Structure Namespace